/* ************************************************************************** */
/*                                                                            */
/*                                                      :::    :::    :::     */
/*   Problem Number: 5597                              :+:    :+:      :+:    */
/*                                                    +:+    +:+        +:+   */
/*   By: dhkim0206 <boj.kr/u/dhkim0206>              +#+    +#+          +#+  */
/*                                                  +#+      +#+        +#+   */
/*   https://boj.kr/5597                           #+#        #+#      #+#    */
/*   Solved: 2025/05/09 22:38:27 by dhkim0206     ###          ###   ##.kr    */
/*                                                                            */
/* ************************************************************************** */
#include <iostream>

int main() {
    int submitted[31] = {0};

    // 28명의 제출 번호를 입력받아 마킹
    for (int i = 0; i < 28; i++) {
        int n;
        std::cin >> n;
        submitted[n] = 1;
    }

    // 제출하지 않은 번호 두 개를 찾아 출력
    for (int i = 1; i <= 30; i++) {
        if (!submitted[i]) {
            std::cout << i << "\n";
        }
    }
    
    return 0;
}