/* ************************************************************************** */
/*                                                                            */
/*                                                      :::    :::    :::     */
/*   Problem Number: 11720                             :+:    :+:      :+:    */
/*                                                    +:+    +:+        +:+   */
/*   By: dhkim0206 <boj.kr/u/dhkim0206>              +#+    +#+          +#+  */
/*                                                  +#+      +#+        +#+   */
/*   https://boj.kr/11720                          #+#        #+#      #+#    */
/*   Solved: 2025/05/24 03:36:59 by dhkim0206     ###          ###   ##.kr    */
/*                                                                            */
/* ************************************************************************** */
#include <stdio.h>

int main() {
    int N;
    char digits[101];      // 숫자 문자열을 저장할 배열 선언
    scanf("%d", &N);       // 숫자 개수 입력
    scanf("%s", digits);   // 숫자 문자열 입력

    int sum = 0;           // 합계 초기화
    for (int i = 0; i < N; i++) {
        sum += digits[i] - '0'; // 각 문자에서 '0'을 빼서 정수로 변환 후 합계에 추가
    }

    printf("%d\n", sum);   // 합계 출력
    return 0;
}